
public class WordPlannerImpl {

	public static void main(String[] args) {
		// 1차적으로 교차점의 개수가 많은 순, 2차적으로 길이가 긴 순으로 정렬된 블록 정보
		int[][] blockSet11x11 = { 
				{5, 2, 7, 100, 3},
				{1, 3, 5, -100, 3},
				{5, 7, 5, -100, 3},
				{3, 0, 5, 100, 2},
				{3, 6, 5, 100, 2},
				{6, 1, 5, -100, 2},
				{0, 9, 5, -100, 2},
				{6, 9, 5, -100, 2},
				{7, 0, 5, 100, 2},
				{7, 6, 5, 100, 2}, 
				{9, 0, 4, 100, 2}, 
				{0, 7, 4, -100, 2},
				{1, 7, 4, 100, 2},
				{7, 3, 4, -100, 2},
				{9, 5, 3, 100, 2},
				{1, 3, 3, 100, 2},
				{0, 1, 5, -100, 1},
				{4, 5, 3, -100, 1},
				{8, 5, 3, -100, 1},
				{0, 5, 3, -100, 1}
				};
		
		WordInsertor wp = new WordInsertor(11, blockSet11x11);
		wp.drawAtOnce();
	}
}
